system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  13                                    |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamMultiRun;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         600;
deltaT          0.1;
adjustTimeStep  yes;
maxCo           50.0;
maxAlphaCo      50.0;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

modules
(
    {
        name fluid;
        type fluidMultiRegion;
        regions (innerAir outerAir);
    }
    {
        name solid;
        type solidMultiRegion;
        regions (heater cylinder);
    }
);

functions
{
    probes_cylinder
    {
        type            probes;
        libs            ("libsampling.so");
        region          cylinder;
        fields          (T);
        probeLocations
        (
            ( 0.07410  0.00000 0.05) // 1 (inner)
            ( 0.00000  0.07410 0.05) // 2 (inner)
            (-0.07410  0.00000 0.05) // 3 (inner)
            (-0.00000 -0.07410 0.05) // 4 (inner)
            ( 0.07500  0.00000 0.05) // 5 (outer)
            ( 0.00000  0.07500 0.05) // 6 (outer)
            (-0.07500  0.00000 0.05) // 7 (outer)
            (-0.00000 -0.07500 0.05) // 8 (outer)
        );
    }
    probes_innerAir
    {
        type            probes;
        libs            ("libsampling.so");
        region          innerAir;
        fields          (T);
        probeLocations
        (
            ( 0.00000  0.03830 0.05) // 9 (air)
            (-0.00000 -0.03830 0.05) // 10 (air)
        );
    }
    surfaces_cylinder
    {
        type            surfaces;
        libs            ("libsampling.so");
        region          cylinder;
        writeControl    timeStep;
        writeInterval   1000;
        surfaceFormat   vtk;
        fields          (T);
        interpolationScheme cellPoint;
        surfaces
        (
            upper_surface
            {
                type            plane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 0.075 0.05);
                    normal  (0 1 0);
                }
            }
            lower_surface
            {
                type            plane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point   (0 -0.075 0.05);
                    normal  (0 -1 0);
                }
            }
        );
    }
}
