0.orig/innerAir/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  13                                    |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.001;
boundaryField
{
    inlet        { type fixedValue; value uniform 0.001; }
    outlet       { type inletOutlet; inletValue uniform 0.001; value uniform 0.001; }
    outerBoundary { type symmetry; }
    frontAndBack { type empty; }
    ".*"         { type kqRWallFunction; value uniform 0.001; }
}
