0.orig/outerAir/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  13                                    |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.01;
boundaryField
{
    inlet        { type fixedValue; value uniform 0.01; }
    outlet       { type inletOutlet; inletValue uniform 0.01; value uniform 0.01; }
    outerBoundary { type symmetry; }
    frontAndBack { type empty; }
    ".*"         { type epsilonWallFunction; value uniform 0.01; }
}
