system/innerAir/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  13                                    |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers {
    "p_rgh.*" { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0.05; }
    "p_rghFinal" { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0; }
    "U.*" { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
    "h.*" { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
    "k.*" { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
    "epsilon.*" { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
    "q.*" { solver PCG; preconditioner DIC; tolerance 1e-5; relTol 0; }
}
PIMPLE {
    nOuterCorrectors 2;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
    pRefCell         0;
    pRefValue        101325;
}
