system/innerAir/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  13                                    |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            probes;
libs            ("libsampling.so");
region          innerAir;
fields          (T);
probeLocations
(
    ( 0.00000  0.03830 0.05) // 9 (air)
    (-0.00000 -0.03830 0.05) // 10 (air)
);
